# 代码格式
## 命名
1. 代码中的命名均不能以下划线或美元符号开始，也不能以下划线或美元符号结束。
2. 所有编程相关的命名严禁使用拼音与英文混合的方式，更不允许直接使用中文的方式。
3. 正确的英文拼写和语法可以让阅读者易于理解，避免歧义。注意，纯拼音命名方式更要避免采用。
4. 常量命名全部大写，单词间用下划线隔开，力求语义表达完整清楚，不要嫌名字长。
5. 抽象类命名使用 Abstract 或 Base 开头；异常类命名使用 Exception 结尾；测试类 命名以它要测试的类的名称开始，以 Test 结尾。
6. POJO 类中的任何布尔类型的变量，都不要加 is 前缀，否则部分框架解析会引起序列 化错误。
7. 包名统一使用小写，点分隔符之间有且仅有一个自然语义的英语单词。包名统一使用 单数形式，但是类名如果有复数含义，类名可以使用复数形式。
8. 避免在子父类的成员变量之间、或者不同代码块的局部变量之间采用完全相同的命名， 使可理解性降低。
9. 杜绝完全不规范的缩写，避免望文不知义。

## 间隔
1. 如果是大括号内为空，则简洁地写成{}即可，大括号中间无需换行和空格；如果是非 空代码块则：
- 左大括号前不换行
- 左大括号后换行
- 右大括号前换行
- 右大括号后还有 else 等代码则不换行；表示终止的右大括号后必须换行
2. 左小括号和右边相邻字符之间不出现空格；右小括号和左边相邻字符之间也不出现空格；而左大括号前需要加空格。
3. if/for/while/switch/do 等保留字与括号之间都必须加空格。
4. 任何二目、三目运算符的左右两边都需要加一个空格。说明：包括赋值运算符=、逻辑运算符&&、加减乘除符号等。
5. 采用 4 个空格缩进，禁止使用 Tab 字符。
6. 注释的双斜线与注释内容之间有且仅有一个空格。
7. 在进行类型强制转换时，右括号与强制转换值之间不需要任何空格隔开。
8. 单行字符数限制不超过 120 个，超出需要换行，换行时遵循如下原则：
- 第二行相对第一行缩进 4 个空格，从第三行开始，不再继续缩进，参考示例。
- 运算符与下文一起换行。
- 方法调用的点符号与下文一起换行。
- 方法调用中的多个参数需要换行时，在逗号后进行。
- 在括号前不要换行。
9. 方法参数在定义和传入时，多个参数逗号后面必须加空格。
10. IDEA 的 text file encoding 设置为 UTF-8; IDEA 中文件的换行符使用 Unix 格式，不要 使用 Windows 格式。

## 常量
1. 不允许任何魔法值（即未经预先定义的常量）直接出现在代码中。
2. 在 long 或者 Long 赋值时，数值后使用大写字母 L，不能是小写字母 l，小写容易跟 数字混淆，造成误解。
3. 常量的复用层次有五层：跨应用共享常量、应用内共享常量、子工程内共享常量、包内共享常量、类内共享常量。
